//SUS0041A JOB 1,'KELLY',NOTIFY=SUS0041
//STEP1    EXEC PGM=IDCAMS
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSIN    DD DSN=SUS0041.GET433.CARDLIB(VLCAT),DISP=SHR
/*