//SUS0041A JOB 1,'KELLY',NOTIFY=SUS0041
//JOBLIB   DD  DSN=SUS0041.GET433.LOADLIB,DISP=SHR
//STEP0    EXEC PGM=SU41PGMT
//IFILE    DD DSN=SHARE.GET433.STUDENT.DATA(CBL4),DISP=SHR
//OFILE    DD DSN=SUS0041.GET433.LABZ.OUTPUT,
//            DISP=(NEW,CATLG,DELETE),
//            DCB=(BLKSIZE=0,LRECL=80,RECFM=FB),
//            SPACE=(CYL,(1,1),RLSE),
//            UNIT=SYSDA
/*