//SUS0041A JOB 1,'KELLY',NOTIFY=SUS0041
//JOBLIB   DD  DSN=SUS0041.GET433.LOADLIB,DISP=SHR
//STEP0    EXEC PGM=SU41PGM7
//IFILE    DD DSN=SHARE.GET433.STUDENT.DATA(CBL9),DISP=SHR
//VFILE    DD DSN=SHARE.GET433.TEST.VSAM,DISP=SHR
//OFILE    DD DSN=SUS0041.GET433.LAB5F.OUTPUT,
//            DISP=(NEW,CATLG,DELETE),
//            DCB=(BLKSIZE=0,LRECL=80,RECFM=FB),
//            SPACE=(CYL,(1,1),RLSE),
//            UNIT=SYSDA
//SYSPRINT DD   SYSOUT=*
//SYSOUT   DD   SYSOUT=*
/*