//SUS0041C JOB 1,NOTIFY=&SYSUID                                         00010004
//APPLPROG EXEC CICSCBL,M=P42ACCT,CLASS=GET433                          00050011
//LKED.SYSIN DD *                                                       00060000
   NAME P42ACCT(R)                                                      00070011