//CICSMAPC JOB 1,NOTIFY=&SYSUID                                         00001000
//BLD1 EXEC CICSMAP,MAPNAME=M42ACCT,CLASS=GET433                        00020008