//SUS0041D JOB 1,NOTIFY=&SYSUID
//DB2    EXEC DB2CBL,MBR=P01,CLASS=GET433
//RUN.REPORT DD DSN=&&TMP,DISP=(NEW,PASS),
// UNIT=SYSALLDA,SPACE=(CYL,(1,1))
//***********************************************
//COPY   EXEC  PGM=ICEGENER
//SYSPRINT DD  SYSOUT=*
//SYSUT1   DD  DSN=&&TMP,DISP=(OLD,DELETE)
//SYSUT2   DD  DSN=&SYSUID..GET433.DB2.OUTPUT(P01),DISP=SHR
//SYSIN    DD  DUMMY